# Assignment-2
## Week - 8
## ML Tool Box Pandas - Pandas Advance Assignment
## Code By - Aniruddh Tiwari

### Q1. List any five functions of the pandas library with execution.

1. describe()
2. head()
3. isnull().sum()
4. Categorical()
5. aggregate

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [5]:
df[df.dtypes[df.dtypes=='object'].index].describe()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
pd.Categorical(df["Pclass"])

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

In [9]:
pd.Categorical(df["Cabin"]).unique

<bound method Categorical.unique of [NaN, 'C85', NaN, 'C123', NaN, ..., NaN, 'B42', NaN, 'C148', NaN]
Length: 891
Categories (147, object): ['A10', 'A14', 'A16', 'A19', ..., 'F38', 'F4', 'G6', 'T']>

In [10]:
df.size

10692

In [11]:
df.aggregate(['sum', 'min'])

/tmp/ipykernel_521/1666930135.py:1: FutureWarning: ['Cabin', 'Embarked'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.aggregate(['sum', 'min'])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare
sum,397386,342,2057,"Braund, Mr. Owen HarrisCumings, Mrs. John Brad...",malefemalefemalefemalemalemalemalemalefemalefe...,21205.17,466,340,A/5 21171PC 17599STON/O2. 31012821138033734503...,28693.9493
min,1,0,1,"Abbing, Mr. Anthony",female,0.42,0,0,110152,0.0000

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [12]:
def reindex_with_custom_increment(df):
    # Get the number of rows in the DataFrame
    num_rows = df.shape[0]

    # Generate the new index with the desired increment
    new_index = [i*1 + 1 for i in range(num_rows)]

    # Assign the new index to the DataFrame
    df_reindexed = df.reset_index(drop=True)
    df_reindexed.index = new_index

    return df_reindexed
data = {'A':[1,2,3,4],'B':[1,2,3,4],'C':[1,2,3,4],'D':[1,2,3,4]}
df = pd.DataFrame(data)
reindex_with_custom_increment(df)

   A  B  C  D
1  1  1  1  1
2  2  2  2  2
3  3  3  3  3
4  4  4  4  4

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [13]:
### One Way to solve this Problem
data = {'Values':[10,20,30,40,50]}
df = pd.DataFrame(data)
value = df['Values']
sum_of_three = sum(value.head(3))
sum_of_three

60

In [14]:
### Another Way to solve this Problem
data = {'Values':[10,20,30,40,50]}
df = pd.DataFrame(data)
values = list(df['Values'])
count = 0
for i in values[0:3]:
    count = count+i
print(count)

60

### Q5. How are DataFrame.size() and DataFrame.shape() different?

In [15]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

##### df.size is an attribute that returns the total number of elements in a DataFrame

In [16]:
df.size

10692

###### df.shape is an attribute that returns a tuple representing the dimensions of a DataFrame df. The tuple contains two elements:

- The number of rows in the DataFrame.
- The number of columns in the DataFrame.

In [17]:
df.shape

(891, 12)

### Q6. Which function of pandas do we use to read an excel file?

In [18]:
df = pd.read_excel("LUSID Excel - Setting up your market data.xlsx")

In [19]:
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for...,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. 
### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Yourfunction should extract the username from each email address and store it in the new 'Username' column.

In [20]:
data = {'Name':['Aniruddh','Alisha','Ayush','Rishu','Abhijit','Ujjwal','Jigyasa','Anushka','Lav','Vaibhav','Kishtij'],
        'Email':['aniruddh@xyz.com','alisha@xyz.com','ayush@xyz.com','rishu@xyz.com','abhijit@xyz.com', 'ujjwal@xyz.com', 'jigyasa@xyz.com', 'anushka@xyz.com','lav@xyz.com','vaibhav@xyz.com','kishtij@xyz.com'],
        'Phone':[9424669633, 9424669633,9424669633,9424669633,9424669633,9424669633,9424669633,9424669633,9424669633,9424669633,9424669633],}
df = pd.DataFrame(data)
df

        Name             Email       Phone
0   Aniruddh  aniruddh@xyz.com  9424669633
1     Alisha    alisha@xyz.com  9424669633
2      Ayush     ayush@xyz.com  9424669633
3      Rishu     rishu@xyz.com  9424669633
4    Abhijit   abhijit@xyz.com  9424669633
5     Ujjwal    ujjwal@xyz.com  9424669633
6    Jigyasa   jigyasa@xyz.com  9424669633
7    Anushka   anushka@xyz.com  9424669633
8        Lav       lav@xyz.com  9424669633
9    Vaibhav   vaibhav@xyz.com  9424669633
10   Kishtij   kishtij@xyz.com  9424669633

In [21]:
def extraxt_un(Email):
    return Email.split('@')[0]
def add_un(df):
    df['User Name'] = df['Email'].apply(extraxt_un)
add_un(df)

In [22]:
df

        Name             Email       Phone User Name
0   Aniruddh  aniruddh@xyz.com  9424669633  aniruddh
1     Alisha    alisha@xyz.com  9424669633    alisha
2      Ayush     ayush@xyz.com  9424669633     ayush
3      Rishu     rishu@xyz.com  9424669633     rishu
4    Abhijit   abhijit@xyz.com  9424669633   abhijit
5     Ujjwal    ujjwal@xyz.com  9424669633    ujjwal
6    Jigyasa   jigyasa@xyz.com  9424669633   jigyasa
7    Anushka   anushka@xyz.com  9424669633   anushka
8        Lav       lav@xyz.com  9424669633       lav
9    Vaibhav   vaibhav@xyz.com  9424669633   vaibhav
10   Kishtij   kishtij@xyz.com  9424669633   kishtij

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
### For example, if df contains the following values:

      A B C

    0 3 5 1

    1 8 2 7

    2 6 9 4

    3 2 3 5

    4 9 1 2
    
### Your function should select the following rows: A B C
    1 8 2 7
    4 9 1 2
### The function should return a new DataFrame that contains only the selected rows.

In [23]:
data = {'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]}
df = pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [24]:
df[df['A']>5]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [25]:
df[df['B']<10]

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [26]:
def selected_row(df):
    row = df[(df['A'] > 5) & (df['B'] < 10)]
    return row
selected_df = selected_row(df)
selected_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [27]:
def stastic(df):
    st = {'Mean of values':[df['Value'].mean()],
          'Median of Values':[df['Value'].median()], 
          'standard deviation of Values':[df['Value'].std()]}
    df1 = pd.DataFrame(st)
    return df1
data = {'Value':[21,43,546,76,9870,90,45,54,7,8,897,34]}
df = pd.DataFrame(data)
stastic(df)

   Mean of values  Median of Values  standard deviation of Values
0          974.25              49.5                   2814.766973

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [28]:
def moving(df):
    df['Moving Average'] = df['Sales'].rolling(window = 7, min_periods=1).mean()
    return df
data = {'Date': pd.date_range(start='2023-07-01', periods=10), 'Sales': [10, 15, 20, 25, 30, 35, 40, 45, 50, 55]}
df = pd.DataFrame(data)
print(moving(df))

        Date  Sales  Moving Average
0 2023-07-01     10            10.0
1 2023-07-02     15            12.5
2 2023-07-03     20            15.0
3 2023-07-04     25            17.5
4 2023-07-05     30            20.0
5 2023-07-06     35            22.5
6 2023-07-07     40            25.0
7 2023-07-08     45            30.0
8 2023-07-09     50            35.0
9 2023-07-10     55            40.0

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
### For example, if df contains the following values:
  Date

0 2023-01-01

1 2023-01-02

2 2023-01-03

3 2023-01-04

4 2023-01-05

Your function should create the following DataFrame:

Date Weekday

0 2023-01-01 Sunday

1 2023-01-02 Monday

2 2023-01-03 Tuesday

3 2023-01-04 Wednesday

4 2023-01-05 Thursday

The function should return the modified DataFrame.

In [29]:
import pandas as pd

def add_weekday_column(df):
    # Convert 'Date' column to Pandas datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Get the weekday names for each date and create 'Weekday' column
    df['Weekday'] = df['Date'].dt.strftime('%A')
    
    return df

# Example DataFrame
data = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']
}
df = pd.DataFrame(data)

# Call the function to add the 'Weekday' column
result_df = add_weekday_column(df)

print(result_df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [30]:
import pandas as pd

def select_rows_between_dates(df):
    # Convert the 'Date' column to datetime if it's not already
    df['Date'] = pd.to_datetime(df['Date'])

    # Define the start and end dates for filtering
    start_date = '2023-01-01'
    end_date = '2023-01-31'

    # Filter the DataFrame using boolean indexing
    filtered_df = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]

    return filtered_df

# Example usage:
# Assuming your DataFrame is called 'df'
filtered_data = select_rows_between_dates(df)
print(filtered_data)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

To use the basic functions of pandas. the first and foremost necessary library that needs to be imported is "Pandas Library"

In [31]:
import pandas as pd